package individual1;

/// все дальнейшие значение будут просто дописываться уже к существующему аккаунта, к примеру какие курсы, какие оценки
// может тогда имеет смысл 

/*
когда юзер заходит в свой аккаунт, просто подтягиваются его оценки сразу с бинарника, вот и все

то есть после того как юзер залогинился ему на панель отображается что за оценки у него на какие курсы он записан

лучше всего полностью строку выность
*/


public class Teacher extends Account {

    private String Courses[];

}
